{
    "starters": {
        "name": "Starters",
        "description": "Plenty of fresh options here - even our onion rings are hand cut and battered in house everyday.",
        "items": [
            {
                "name": "Jumbo Combo",
                "description": "A delectable array of our most popular starters that’s big enough to share. Includes Santa Fe Spring Rolls, Hickory-Smoked Chicken Wings, Onion Rings, Potato Skins and Tupelo Chicken Tenders. Served with four different sauces for mixing and matching."
            },
            {
                "name": "Ringo Combo",
                "description": "A smaller combination of our most popular starters: Potato Skins, Tupelo Chicken, tenders and Sante Fe Spring Rolls. Served with sour cream, honey mustard and Hard Rock Salsa for dipping."
            },
            {
                "name": "Tupelo Chicken Tenders",
                "description": "Boneless, seasoned and breaded chicken tenders, served with honey-mustard and Hickory Bar-B-Que sauces on the side or tossed in our Classic Rock, Heavy Metal, or Tangy Bar-B-Que sauces. Served with celery sticks and blue cheese dressing."
            },
            {
                "name": "Hickory Smoked Chicken Wings",
                "description": "Colossal wings, hickory-smoked in our hardwood smoker. Have them Buffalo style or fire-grilled with your choice of Classic Rock, Heavy Metal, or Tangy Bar-B-Que sauces. Served with celery sticks and blue cheese dressing."
            },
            {
                "name": "Hard Rock Nachos",
                "description": "Fresh corn tortilla chips layered with homemade queso, piled high topped with Monterey Jack and Cheddar cheeses & seasoned pinto beans. Served with sour cream, chopped green onions, pico de gallo, jalapenos & a side of freshly made Hard Rock Salsa. Add Grilled Chicken, BBQ Pulled Pork, Grilled Fajita Beef, or Guacamole for an additional charge."
            },
            {
                "name": "Potato Skins",
                "description": "Large potato shells, fried golden brown, filled with Jack and Cheddar cheeses, crisp seasoned bacon and green onions. Served with a side of sour cream for dipping."
            }
        ]
    },
    "mains": {
        "name": "Mains",
        "description": "We strive to procure only the finest ingredients available. All our steaks are (CAAB) Certified Australian Angus Beef.",
        "items": [
            {
                "name": "Famous Fajitas",
                "description": "Your choice of grilled chicken or beef served with pico de gallo, shredded Jack and Cheddar cheeses, fresh guacamole, sour cream, shredded lettuce and hot flour tortillas.",
                "options": [
                    "Grilled Chicken",
                    "Grilled Beef",
                    "Grilled Shrimp",
                    "Duo Combo ",
                    "Trio Combo"
                ]
            },
            {
                "name": "New York Strip Steak",
                "description": "An aged Certified Australian Angus, 341gram New York strip steak grilled to your liking and topped with Merlot-garlic butter. Served with smashed potatoes, gravy and fresh vegetables. Option to add grilled shrimp available."
            },
            {
                "name": "Jack Daniel's Steak",
                "description": "An 8 oz. rump steak marinated in our own house-made Jack Daniel’s Bar-B-Que sauce; grilled to your liking. Served with fresh vegetables, garlic smashed potatoes and gravy. g"
            },
            {
                "name": "Twisted Mac, Chicken and Cheese",
                "description": "A grilled chicken breast tops off twisted Cavatappi pasta tossed in a lightly spiced 3-cheese sauce, with garlic, roasted red peppers and romano parsley bread crumbs. Served with a side of garlic toast."
            },
            {
                "name": "Tasmanian Salmon",
                "description": "An 6 oz. filet grilled and topped with a Merlotgarlic butter and served with garlic smashed potatoes and fresh vegetables.*g"
            },
            {
                "name": "Roasted Vegetable Pasta",
                "description": "Fire-roasted tomatoes and Mediterranean vegetables topped on a bed of penne pasta in a marinara-pesto sauce with Romano cheese and parsley."
            },
            {
                "name": "Surf 'n' Turf",
                "description": "Take 16 oz. of Australian Angus Ribeye, add our succulent cajun shrimp and top it all with our Merlot-garlic butter. It comes with garlic smashed potatoes, gravy and fresh vegetables of the day.*g"
            },
            {
                "name": "Herb Chicken",
                "description": "A boneless, marinated 10 oz. chicken breast, grilled and marinated with fresh herbs, garlic and pure olive oil. Served on top of garlic smashed potatoes, with oven roasted mushrooms, fresh vegetable of the day and a light herb sauce.*g"
            },
            {
                "name": "Blackened Chicken Pasta",
                "description": "A grilled Cajun marinated chicken breast, andouille sausage, tomatoes and fresh spinach leaves on alfredo penne pasta and topped with Parmesan-Parsley cheese."
            }
        ]
    },
    "burgers": {
        "name": "Legendary Burgers",
        "description": "That six-string on the wall isn’t just a guitar. Our proprietary blend of fresh, Prime & Choice Australian Beef isn’t just a burger. It’s a legend. And has been for nearly four delicious decades. All cooked medium-well (unless you say otherwise).",
        "items": [
            {
                "name": "Legendary Aussie Burger",
                "description": "Melted Cheddar cheese, caramelized onions, crisp seasoned bacon, beetroot, a fried egg, lettuce, tomato and pickle. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "Hickory Bar-B-Que Bacon Cheeseburger",
                "description": "Basted with our special Hickory Bar-B-Que sauce and smothered with caramelized onions. Topped with crisp seasoned bacon and melted Cheddar cheese. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "The Big Cheeseburger",
                "description": "Topped with three thick slices of your choice of cheeses. Choose from American, Cheddar or Swiss. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "S.O.B. Burger",
                "description": "Basted with spicy chipotle pepper puree and topped with Monterey Jack cheese, served on a toasted bun with Hard Rock guacamole and grilled onions. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "Original Legendary Burger",
                "description": "Famous the world over: topped with seasoned bacon, two slices of Cheddar cheese, a crisp fried onion ring, lettuce, tomato, and pickles. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "Classic Bacon Cheeseburger",
                "description": "The same great Hard Rock Legendary beef hamburger, lightly seasoned and cooked to order. Served with your choice of cheese: American, Cheddar or Swiss. Garnished with lettuce, tomato, red onion and pickles. Served with seasoned french fries and your choice of a 6oz or 10oz patty.*"
            },
            {
                "name": "Classic Burger",
                "description": "The same great Hard Rock Legendary experience, just in a smaller size. A beef hamburger, lightly seasoned and cooked to order. Garnished with lettuce, tomato, red onion and pickles. Served with seasoned fries.*"
            },
            {
                "name": "Veggie Leggie",
                "description": "Our grilled Veggie Leggie patty is topped with a grilled Portabello mushroom, zucchini, yellow squashand roasted red pepper. Served on a toasted bun with lemon-mayo, leaf lettuce, sliced tomato and grilled sweet onions.*"
            },
            {
                "name": "Legendary Chicken",
                "description": "Substitute your 10 oz. Beef burger for a grilled 8 oz. Chicken breast. No extra costs apply."
            }
        ]
    },
    "smokehouse": {
        "name": "Smokehouse",
        "description": "Our roots are in the Southern cooking of our founder’s hometown of Memphis, Tennessee. Nothing's more authentically, delectably Memphis than Bar-B-Que.",
        "items": [
            {
                "name": "Hickory-Smoked Bar-B-Que Combo",
                "description": "Your Choice of Bar-B-Que Ribs, Bar-B-Que Chicken or Bar-B-Que Beef Brisket. Served with seasoned fries, ranch beans and fresh coleslaw.",
                "options": [
                    "Duo Combo",
                    "Trio Combo"
                ]
            },
            {
                "name": "Hickory-Smoked Bar-B-Que Chicken",
                "description": "Our famous Southern-style half-chicken, rubbed, grilled, and basted with our authentic Hickory Bar-B-Que sauce. Served with seasoned fries, ranch beans and fresh coleslaw."
            },
            {
                "name": "Hickory-Smoked Bar-B-Que Ribs",
                "description": "A full rack of West Tennessee-style ribs rubbed then basted with our authentic Hickory Bar-B-Que sauce or Texan sauce and cooked to perfection – so the meat falls right off the bone. Served with seasoned fries, ranch beans and fresh coleslaw."
            },
            {
                "name": "Hickory-Smoked Bar-B-Que Brisket",
                "description": "Beef brisket, slowly Hickory-smoked for 14 hours. Topped with Hickory Bar-B-Que sauce and crisp fried onion straws. Served with seasoned fries, ranch beans and fresh coleslaw.*"
            }
        ]
    },
    "smokehousesandwiches": {
        "name": "Smokehouse Sandwiches",
        "description": "If you’re looking for pulled-pork, you’ve come to the right place. We’re the Smokehouse masters, from down ‘round Elvis’s town. We were born and raised to cook you pulled-pork. Custom smoked fresh pork, hand-pulled, tender and juicy. All sandwiches s",
        "items": [
            {
                "name": "Hickory-Smoked Pulled-Pork Sandwich",
                "description": "Hickory-smoked pork, hand pulled, so it’s tender and juicy. Served with your choice of our authentic vinegar-based or Hickory Bar-B-Que sauces and topped with marinated slaw.*"
            },
            {
                "name": "Smoked Bar-B-Que Brisket Sandwich",
                "description": "Our slow Hickory-smoked thick sliced beef brisket topped with Hickory Bar-B-Que sauce and crisp fried onion straws. Served with seasoned fries, ranch beans and fresh coleslaw.*"
            },
            {
                "name": "The Texan",
                "description": "Chipotle and Hickory Bar-B-Que sauce, cheddar cheese, crispy jalapeños and crispy onions ... everything is bigger in Texas!"
            }
        ]
    },
    "sandwiches": {
        "name": "Sandwiches",
        "description": "All sandwiches served with seasoned fries or substitute onion rings for an additional charge. Add a side Caesar/ House salad for an added charge.",
        "items": [
            {
                "name": "California Chicken Club Sandwich",
                "description": "Grilled chicken, crisp seasoned bacon, fresh avocado slices, tomato, lemon mayo and lettuce on toasted bread. Served with seasoned fries.*"
            },
            {
                "name": "Open-Faced Steak Sandwich",
                "description": "Seasoned and sliced 8 oz. rump steak served on Panini bread and grilled to your liking. Topped with caramelized onion, Swiss cheese and gravy with coral leaf lettuce and fresh tomato slices. Served with seasoned french fries."
            },
            {
                "name": "Cajun Chicken Sandwich",
                "description": "Grilled 6 oz. chicken breast basted in cajun spices, topped with Spanish sausage, melted Jack cheese and served on a lemon-mayo toasted bun. Garnished with lettuce, tomato and onion. Served with seasoned fries and fresh coleslaw."
            },
            {
                "name": "Honey Mustard Grilled Chicken Sandwich",
                "description": "A grilled boneless chicken breast served on a butter toasted bun with honey mustard, bacon, lettuce, tomato and Jack cheese. Served with seasoned fries and fresh coleslaw."
            }
        ]
    },
    "salads": {
        "name": "Salads",
        "description": "Hard Rock dressings: Ranch, Honey-Mustard, Honey-Citrus, Caesar, Blue Cheese, Balsamic Vinaigrette, Olive Oil & Vinegar and Lite Italian",
        "items": [
            {
                "name": "Haystack Chicken Salad",
                "description": "This Hard Rock special combines fresh mixed greens, carrots, corn, diced tomatoes, pico de gallo and shredded cheese. Topped with Tupelo fried chicken or a grilled chicken breast. Tossed with ranch dressing and topped with spiced pecans and crisp tortilla straws."
            },
            {
                "name": "Caesar Salad",
                "description": "Crisp Romaine lettuce tossed with our scratch-made Caesar dressing, fresh baked croutons, grated Romano cheese and crispy seasoned bacon bits. Garnished with shaved Parmesan cheese and whole black olives.",
                "options": [
                    "Add Grilled Chicken",
                    "Add Grilled Shrimp",
                    "Add Grilled Salmon",
                    "Add Grilled Fajita Beef"
                ]
            },
            {
                "name": "Smokehouse Chop Salad",
                "description": "Freshly chopped mixed field greens tossed with diced chicken, spicy bacon and pecans, cheddar cheese, pico de gallo and avocados with a smoky citrus vinaigrette."
            }
        ]
    },
    "sides": {
        "name": "Sides",
        "description": "",
        "items": [
            {
                "name": "Seasoned French Fries",
                "description": ""
            },
            {
                "name": "Garlic Toast",
                "description": ""
            },
            {
                "name": "Garlic Herb Smashed Potatoes With Gravy",
                "description": ""
            },
            {
                "name": "Seasonal Veggies",
                "description": ""
            },
            {
                "name": "Side House Salad",
                "description": ""
            },
            {
                "name": "Side Caesar Salad",
                "description": ""
            },
            {
                "name": "Hand-Breaded Onion Rings",
                "description": ""
            },
            {
                "name": "Twisted Mac and Cheese",
                "description": ""
            },
            {
                "name": "Grilled Shrimp",
                "description": ""
            }
        ]
    },
    "desserts": {
        "name": "Desserts",
        "description": "Nothing says Rock'n'Roll heaven like a sweet lick of homemade dessert.",
        "items": [
            {
                "name": "Fresh Apple Cobbler",
                "description": "A country favourite, served warm with vanilla ice cream, topped with walnuts and caramel sauce."
            },
            {
                "name": "Rocky Road Sundae",
                "description": "A colossal mountain of delicious marshmallows, peanuts, cherries, chocolate ice cream and whipped cream."
            },
            {
                "name": "Thick Shakes",
                "description": "Your choice of vanilla or chocolate ice cream. Another Hard Rock Cafe legend. Put it in a souvenir 23 oz. Hurricane glass or 20 oz. Pint and keep the glass (additional fee)."
            },
            {
                "name": "Hot Fudge Brownie",
                "description": "Vanilla ice cream and hot fudge on a fresh brownie, topped with chopped walnuts, chocolate sprinkles, fresh whipped cream and a cherry."
            },
            {
                "name": "Sinful Hot Fudge Sundae",
                "description": "Three large scoops of vanilla ice cream, topped with our famous hot fudge sauce, chopped walnuts, fresh whipped cream, chocolate sprinkles and a cherry."
            },
            {
                "name": "Chocolate Mousse",
                "description": "Simple and light; rich whipped chocolate mousse served with a light chocolate sauce."
            },
            {
                "name": "Créme Brulée",
                "description": "A rich French pastry cream topped with a sugar brûlée crust."
            },
            {
                "name": "Peanut Butter Pie",
                "description": "Delicious home-made peanut butter and chocolate pie topped with hot chocolate fudge sauce,"
            },
            {
                "name": "Ice Cream",
                "description": "Ask your server for our selection of Hard Rock signature ice cream."
            },
            {
                "name": "Baker's Choice",
                "description": "Ask your server for the dessert of the day."
            }
        ]
    },
    "kidsmenu": {
        "name": "Kids Menu",
        "description": "For ages 10 and under. Set price includes Kids Drink & Seasoned French Fries.",
        "items": [
            {
                "name": "Cheeseburger",
                "description": "A lil' version of our famous Beef Hard Rock Cafe burger on a toasted bun. Choice of American, Cheddar or Swiss cheese. Served with french fries on the side."
            },
            {
                "name": "Cheesy Mac",
                "description": "Every Lil' Rocker's favorite - twisted macaroni & a creamy cheese sauce. Served with garlic toast."
            },
            {
                "name": "Chicken Tenders",
                "description": "Crisp fried chicken served with honey mustard sauce. Served with french fries."
            },
            {
                "name": "Hot Dog",
                "description": "An all-beef hot dog on a toasted bun. Served with french fries."
            },
            {
                "name": "Oven Roasted Chicken Salad",
                "description": "Fresh greens, toasted croutons, oven roasted chicken breast, seasoned bacon bits, Cheddar and Jack cheese. Served with your choice of dressing."
            },
            {
                "name": "HRC Fish 'N' Chips",
                "description": "Australian Baramundi fried in your choice of tempura batter or fine breadcrumbs served with french fries & our own tartare sauce."
            },
            {
                "name": "Pasta with Rice and Sauce",
                "description": "Twisted macaroni with red sauce. Served with french fries."
            }
        ]
    }
}
